MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2025DAG169/mcu.h
#define _GLCDCLUT124_BLUE_POSITION               0x00000000
#define _GLCDCLUT124_BLUE_MASK                   0x000000FF
#define _GLCDCLUT124_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT124_GREEN_POSITION              0x00000008
#define _GLCDCLUT124_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT124_GREEN_LENGTH                0x00000008

#define _GLCDCLUT124_RED_POSITION                0x00000010
#define _GLCDCLUT124_RED_MASK                    0x00FF0000
#define _GLCDCLUT124_RED_LENGTH                  0x00000008

#define _GLCDCLUT125_BLUE_POSITION               0x00000000
#define _GLCDCLUT125_BLUE_MASK                   0x000000FF
#define _GLCDCLUT125_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT125_GREEN_POSITION              0x00000008
#define _GLCDCLUT125_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT125_GREEN_LENGTH                0x00000008

#define _GLCDCLUT125_RED_POSITION                0x00000010
#define _GLCDCLUT125_RED_MASK                    0x00FF0000
#define _GLCDCLUT125_RED_LENGTH                  0x00000008

#define _GLCDCLUT126_BLUE_POSITION               0x00000000
#define _GLCDCLUT126_BLUE_MASK                   0x000000FF
#define _GLCDCLUT126_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT126_GREEN_POSITION              0x00000008
#define _GLCDCLUT126_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT126_GREEN_LENGTH                0x00000008

#define _GLCDCLUT126_RED_POSITION                0x00000010
#define _GLCDCLUT126_RED_MASK                    0x00FF0000
#define _GLCDCLUT126_RED_LENGTH                  0x00000008

#define _GLCDCLUT127_BLUE_POSITION               0x00000000
#define _GLCDCLUT127_BLUE_MASK                   0x000000FF
#define _GLCDCLUT127_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT127_GREEN_POSITION              0x00000008
#define _GLCDCLUT127_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT127_GREEN_LENGTH                0x00000008

#define _GLCDCLUT127_RED_POSITION                0x00000010
#define _GLCDCLUT127_RED_MASK                    0x00FF0000
#define _GLCDCLUT127_RED_LENGTH                  0x00000008

#define _GLCDCLUT128_BLUE_POSITION               0x00000000
#define _GLCDCLUT128_BLUE_MASK                   0x000000FF
#define _GLCDCLUT128_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT128_GREEN_POSITION              0x00000008
#define _GLCDCLUT128_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT128_GREEN_LENGTH                0x00000008

#define _GLCDCLUT128_RED_POSITION                0x00000010
#define _GLCDCLUT128_RED_MASK                    0x00FF0000
#define _GLCDCLUT128_RED_LENGTH                  0x00000008

#define _GLCDCLUT129_BLUE_POSITION               0x00000000
#define _GLCDCLUT129_BLUE_MASK                   0x000000FF
#define _GLCDCLUT129_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT129_GREEN_POSITION              0x00000008
#define _GLCDCLUT129_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT129_GREEN_LENGTH                0x00000008

#define _GLCDCLUT129_RED_POSITION                0x00000010
#define _GLCDCLUT129_RED_MASK                    0x00FF0000
#define _GLCDCLUT129_RED_LENGTH                  0x00000008

#define _GLCDCLUT130_BLUE_POSITION               0x00000000
#define _GLCDCLUT130_BLUE_MASK                   0x000000FF
#define _GLCDCLUT130_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT130_GREEN_POSITION              0x00000008
#define _GLCDCLUT130_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT130_GREEN_LENGTH                0x00000008

#define _GLCDCLUT130_RED_POSITION                0x00000010
#define _GLCDCLUT130_RED_MASK                    0x00FF0000
#define _GLCDCLUT130_RED_LENGTH                  0x00000008

#define _GLCDCLUT131_BLUE_POSITION               0x00000000
#define _GLCDCLUT131_BLUE_MASK                   0x000000FF
#define _GLCDCLUT131_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT131_GREEN_POSITION              0x00000008
#define _GLCDCLUT131_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT131_GREEN_LENGTH                0x00000008

#define _GLCDCLUT131_RED_POSITION                0x00000010
#define _GLCDCLUT131_RED_MASK                    0x00FF0000
#define _GLCDCLUT131_RED_LENGTH                  0x00000008

#define _GLCDCLUT132_BLUE_POSITION               0x00000000
#define _GLCDCLUT132_BLUE_MASK                   0x000000FF
#define _GLCDCLUT132_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT132_GREEN_POSITION              0x00000008
#define _GLCDCLUT132_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT132_GREEN_LENGTH                0x00000008

#define _GLCDCLUT132_RED_POSITION                0x00000010
#define _GLCDCLUT132_RED_MASK                    0x00FF0000
#define _GLCDCLUT132_RED_LENGTH                  0x00000008

#define _GLCDCLUT133_BLUE_POSITION               0x00000000
#define _GLCDCLUT133_BLUE_MASK                   0x000000FF
#define _GLCDCLUT133_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT133_GREEN_POSITION              0x00000008
#define _GLCDCLUT133_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT133_GREEN_LENGTH                0x00000008

#define _GLCDCLUT133_RED_POSITION                0x00000010
#define _GLCDCLUT133_RED_MASK                    0x00FF0000
#define _GLCDCLUT133_RED_LENGTH                  0x00000008

#define _GLCDCLUT134_BLUE_POSITION               0x00000000
#define _GLCDCLUT134_BLUE_MASK                   0x000000FF
#define _GLCDCLUT134_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT134_GREEN_POSITION              0x00000008
#define _GLCDCLUT134_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT134_GREEN_LENGTH                0x00000008

#define _GLCDCLUT134_RED_POSITION                0x00000010
#define _GLCDCLUT134_RED_MASK                    0x00FF0000
#define _GLCDCLUT134_RED_LENGTH                  0x00000008

#define _GLCDCLUT135_BLUE_POSITION               0x00000000
#define _GLCDCLUT135_BLUE_MASK                   0x000000FF
#define _GLCDCLUT135_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT135_GREEN_POSITION              0x00000008
#define _GLCDCLUT135_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT135_GREEN_LENGTH                0x00000008

